# Project Name - Yes Bank Stock Closing Price Predicition

- Project Type - Yes Bank Stock Closing Price Predicition
- Contribution - Group
- Team Member 1 - Vipil Khapre
- Team Member 2 - Pranay Kuthe

# GitHub Link

# Problem Statement (Data Set Information)

- In recent years, Yes Bank, a prominent bank in the Indian financial sector, has garnered significant attention due to a high-profile fraud case involving its former CEO Rana Kapoor. The objective of this project is to explore the impact of such events on the stock prices of the bank and determine whether time series models or other predictive models can effectively capture the dynamics of stock price movements. The dataset at hand contains monthly stock price information for Yes Bank, spanning from its inception. This dataset includes the closing, opening, highest, and lowest stock prices for each month. The primary goal is to develop predictive models that can accurately forecast the closing stock price for the upcoming months.

# Let's Begin !

## ***1. Know Your Data***

### Import Libraries

In [53]:
# Import Libraries
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
from datetime import datetime
from datetime import date
%matplotlib inline

### Dataset Loading

In [54]:
df =pd.read_csv('data_YesBank_StockPrices.csv')

### Dataset First and last View

In [55]:
# Dataset first and last 
df.head()

     Date   Open   High    Low  Close
0  Jul-05  13.00  14.00  11.25  12.46
1  Aug-05  12.58  14.88  12.55  13.42
2  Sep-05  13.48  14.87  12.27  13.30
3  Oct-05  13.20  14.47  12.40  12.99
4  Nov-05  13.35  13.88  12.88  13.41

In [56]:
df.tail()

       Date   Open   High    Low  Close
180  Jul-20  25.60  28.30  11.10  11.95
181  Aug-20  12.00  17.16  11.85  14.37
182  Sep-20  14.30  15.34  12.75  13.15
183  Oct-20  13.30  14.01  12.11  12.42
184  Nov-20  12.41  14.90  12.21  14.67

### Dataset Rows & Columns count

In [57]:
# Dataset Rows and Columns
df.shape

(185, 5)

### Dataset Information

In [58]:
# Dataset info
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 185 entries, 0 to 184
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    185 non-null    object
 1   Open    185 non-null    float64
 2   High    185 non-null    float64
 3   Low     185 non-null    float64
 4   Close   185 non-null    float64
dtypes: float64(4), object(1)
memory usage: 7.4+ KB

### What did you know about your dataset?

# Checking missing values

In [59]:
# Checking missing values in the dataset
df.isnull().sum()

Date     0
Open     0
High     0
Low      0
Close    0
dtype: int64

## ***2. Understanding Your Variables***

In [60]:
# Dataset columns
df.columns

Index(['Date', 'Open', 'High', 'Low', 'Close'], dtype='object')

#### Description of variables of the dataframe

In [61]:
# Shoing statistical information for the dataset
df.describe()

             Open        High         Low       Close
count  185.000000  185.000000  185.000000  185.000000
mean   105.541405  116.104324   94.947838  105.204703
std     98.879850  106.333497   91.219415   98.583153
min     10.000000   11.240000    5.550000    9.980000
25%     33.800000   36.140000   28.510000   33.450000
50%     62.980000   72.550000   58.000000   62.540000
75%    153.000000  169.190000  138.350000  153.300000
max    369.950000  404.000000  345.500000  367.900000

### Variables Description

1. Date  : Date of records
2. Open  : Opening price
3. High  : Highest price in the day
4. Low   : Lowest price in the day
5. Close : Occupation of the speaker

### Check Unique Values for each variable.

In [62]:
# Check Unique Values for each variable.
for i in df.columns.tolist():
  print("No. of unique values in",i,"is",df[i].nunique())

No. of unique values in Date is 185
No. of unique values in Open is 183
No. of unique values in High is 184
No. of unique values in Low is 183
No. of unique values in Close is 185

### Check duplicate values.

In [63]:
# there is no duplicate value avaliable in the dataset
df.duplicated().sum()

0

# Creating a new columns

In [64]:
# Creating a new columns name 'Day amd 'Month' from 'Date' column in the dataset 
df['Day'] = df['Date'].str.split('-').str[1]
df['Month'] = df['Date'].apply(lambda x: datetime.strptime(x, '%b-%y').month)
df = df.drop('Date',axis=1)

# Changing the Data type of the columns from the dataset

In [69]:
# changing the datatype of the Day column from object to int
df['Day'] = df['Day'].astype(int)

##  Exploratory Data Analysis (EDA)

In [70]:
df.head()

    Open   High    Low  Close  Day  Month
0  13.00  14.00  11.25  12.46    5      7
1  12.58  14.88  12.55  13.42    5      8
2  13.48  14.87  12.27  13.30    5      9
3  13.20  14.47  12.40  12.99    5     10
4  13.35  13.88  12.88  13.41    5     11

In [76]:
df.groupby('Day')[['Open','High','Close']].sum()

        Open     High    Close
Day
5      79.10    86.54    79.29
6     220.82   253.09   232.20
7     421.93   476.92   442.48
8     375.51   411.97   339.03
9     323.29   392.14   360.39
10    695.36   762.10   703.75
11    706.38   760.10   686.68
12    847.78   930.93   891.38
13    991.30  1112.98   967.02
14   1205.56  1349.27  1283.37
15   1933.70  2032.73  1921.35
16   2485.49  2690.71  2562.29
17   3709.58  4005.61  3783.68
18   3608.70  3983.05  3463.65
19   1644.00  1870.30  1503.15
20    276.66   360.86   243.16

In [77]:
df.sort_values(by='Open', ascending=False).head(10)[

       Open    High     Low   Close  Day  Month
157  369.95  404.00  338.00  343.40   18      8
145  363.00  368.52  337.37  351.15   17      8
154  362.85  364.40  325.70  346.20   18      5
151  355.00  366.50  304.65  322.25   18      2
147  354.60  375.75  299.00  314.35   17     10
146  351.00  383.25  345.50  350.00   17      9
155  348.00  350.10  327.35  339.60   18      6
158  347.20  350.00  166.15  183.45   18      9
156  340.00  393.35  332.45  367.90   18      7
142  326.00  330.30  275.15  286.38   17      5

TypeError: 'method' object is not subscriptable